# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11 object detection model with P3-P5 outputs. 
# Combined model: EAW-Yolo11 backbone (EC3k2 + C2AIFI) + FEFM fusion mechanism in head
# This combines the advantages of both EAW-Yolo11 and FEFM fusion modules

# Parameters
nc: 1 # number of classes (Fish detection dataset)
scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 319 layers, 2624080 parameters, 2624064 gradients, 6.6 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 319 layers, 9458752 parameters, 9458736 gradients, 21.7 GFLOPs
  m: [0.50, 1.00, 512] # summary: 409 layers, 20114688 parameters, 20114672 gradients, 68.5 GFLOPs
  l: [1.00, 1.00, 512] # summary: 631 layers, 25372160 parameters, 25372144 gradients, 87.6 GFLOPs
  x: [1.00, 1.50, 512] # summary: 631 layers, 56966176 parameters, 56966160 gradients, 196.0 GFLOPs

# YOLO11n backbone (EAW version: EC3k2 + C2AIFI)
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, EC3k2, [256, False, 0.25]] # 2 - EAW enhanced C3k2
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, EC3k2, [512, False, 0.25]] # 4 - EAW enhanced C3k2
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, EC3k2, [512, True]] # 6 - EAW enhanced C3k2
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, EC3k2, [1024, True]] # 8 - EAW enhanced C3k2
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 2, C2AIFI, [1024]] # 10 - EAW attention mechanism

# YOLO11n head (FEFM fusion + EC3k2)
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 11 - Upsample P5 to match P4
  - [[-1, 6], 1, FEFM, [256, 128, 384]] # 12 - FEFM fusion: upsample(1024->256) + P4(512->128) -> 384
  - [-1, 2, EC3k2, [512, False]] # 13 - EAW enhanced processing

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 14 - Upsample to match P3
  - [[-1, 4], 1, FEFM, [128, 128, 256]] # 15 - FEFM fusion: upsample(256) + P3(256->128) -> 256
  - [-1, 2, C3k2, [256, False]] # 16 (P3/8-small) - EAW enhanced processing

  - [-1, 1, Conv, [256, 3, 2]] # 17 - Downsample for P4
  - [[-1, 13], 1, FEFM, [64, 128, 192]] # 18 - FEFM fusion: downsample(256->64) + P4(512->128) -> 192
  - [-1, 2, C3k2, [512, False]] # 19 (P4/16-medium) - EAW enhanced processing

  - [-1, 1, Conv, [512, 3, 2]] # 20 - Downsample for P5
  - [[-1, 10], 1, FEFM, [128, 256, 384]] # 21 - FEFM fusion: downsample(512->128) + P5(1024->256) -> 384
  - [-1, 2, C3k2, [1024, True]] # 22 (P5/32-large) - EAW enhanced processing

  - [[16, 19, 22], 1, Detect, [nc]] # Detect(P3, P4, P5)

